cmsis-svd/cmsis-svd/data/Atmel/ATSAME51J18A.svd
               <register>
                  <dim>2</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>CCBUF[%s]</name>
                  <description>COUNT32 Compare and Capture Buffer</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>CCBUF</name>
                        <description>Counter/Compare Buffer Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC1</name>
         <baseAddress>0x40003C00</baseAddress>
         <interrupt>
            <name>TC1</name>
            <value>108</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC2</name>
         <baseAddress>0x4101A000</baseAddress>
         <interrupt>
            <name>TC2</name>
            <value>109</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC3</name>
         <baseAddress>0x4101C000</baseAddress>
         <interrupt>
            <name>TC3</name>
            <value>110</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC4</name>
         <baseAddress>0x42001400</baseAddress>
         <interrupt>
            <name>TC4</name>
            <value>111</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC5</name>
         <baseAddress>0x42001800</baseAddress>
         <interrupt>
            <name>TC5</name>
            <value>112</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>TCC0</name>
         <version>U22133.1.0</version>
         <description>Timer Counter Control</description>
         <groupName>TCC</groupName>
         <prependToName>TCC_</prependToName>
         <baseAddress>0x41016000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x88</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TCC0_OTHER</name>
            <value>85</value>
         </interrupt>
         <interrupt>
            <name>TCC0_MC0</name>
            <value>86</value>
         </interrupt>
         <interrupt>
            <name>TCC0_MC1</name>
            <value>87</value>
         </interrupt>
         <interrupt>
            <name>TCC0_MC2</name>
            <value>88</value>
         </interrupt>
         <interrupt>
            <name>TCC0_MC3</name>
            <value>89</value>
         </interrupt>
         <interrupt>
            <name>TCC0_MC4</name>
            <value>90</value>
         </interrupt>
         <interrupt>
            <name>TCC0_MC5</name>
            <value>91</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RESOLUTION</name>
                     <description>Enhanced Resolution</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RESOLUTIONSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>Dithering is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DITH4</name>
                           <description>Dithering is done every 16 PWM frames</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DITH5</name>
                           <description>Dithering is done every 32 PWM frames</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DITH6</name>
                           <description>Dithering is done every 64 PWM frames</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRESCALER</name>
                     <description>Prescaler</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PRESCALERSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>No division</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide by 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>Divide by 4</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>Divide by 8</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide by 16</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>Divide by 64</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV256</name>
                           <description>Divide by 256</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV1024</name>
                           <description>Divide by 1024</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRESCSYNC</name>
                     <description>Prescaler and Counter Synchronization Selection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PRESCSYNCSelect</name>
                        <enumeratedValue>
                           <name>GCLK</name>
                           <description>Reload or reset counter on next GCLK</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRESC</name>
                           <description>Reload or reset counter on next prescaler clock</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESYNC</name>
                           <description>Reload or reset counter on next GCLK and reset prescaler counter</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ALOCK</name>
                     <description>Auto Lock</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSYNC</name>
                     <description>Master Synchronization (only for TCC Slave Instance)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAOS</name>
                     <description>DMA One-shot Trigger Mode</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPTEN0</name>
                     <description>Capture Channel 0 Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPTEN1</name>
                     <description>Capture Channel 1 Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPTEN2</name>
                     <description>Capture Channel 2 Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPTEN3</name>
                     <description>Capture Channel 3 Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPTEN4</name>
                     <description>Capture Channel 4 Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPTEN5</name>
                     <description>Capture Channel 5 Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLBCLR</name>
               <description>Control B Clear</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DIR</name>
                     <description>Counter Direction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LUPD</name>
                     <description>Lock Update</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONESHOT</name>
                     <description>One-Shot</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDXCMD</name>
                     <description>Ramp Index Command</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>IDXCMDSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Command disabled: Index toggles between cycles A and B</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET</name>
                           <description>Set index: cycle B will be forced in the next cycle</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR</name>
                           <description>Clear index: cycle A will be forced in the next cycle</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOLD</name>
                           <description>Hold index: the next cycle will be the same as the current cycle</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMD</name>
                     <description>TCC Command</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CMDSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No action</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RETRIGGER</name>
                           <description>Clear start, restart or retrigger</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>Force stop</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE</name>
                           <description>Force update or double buffered registers</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READSYNC</name>
                           <description>Force COUNT read synchronization</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMAOS</name>
                           <description>One-shot DMA trigger</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLBSET</name>
               <description>Control B Set</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DIR</name>
                     <description>Counter Direction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LUPD</name>
                     <description>Lock Update</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONESHOT</name>
                     <description>One-Shot</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDXCMD</name>
                     <description>Ramp Index Command</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>IDXCMDSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Command disabled: Index toggles between cycles A and B</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET</name>
                           <description>Set index: cycle B will be forced in the next cycle</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR</name>
                           <description>Clear index: cycle A will be forced in the next cycle</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOLD</name>
                           <description>Hold index: the next cycle will be the same as the current cycle</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMD</name>
                     <description>TCC Command</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CMDSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No action</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RETRIGGER</name>
                           <description>Clear start, restart or retrigger</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>Force stop</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE</name>
                           <description>Force update or double buffered registers</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READSYNC</name>
                           <description>Force COUNT read synchronization</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMAOS</name>
                           <description>One-shot DMA trigger</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
